Environment: dev. Pipeline Stage: dev
Plan has been truncated:
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-1"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-cloud-agent-1"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-2"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-cloud-agent-2"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-test"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-cloud-agent-test"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-device-manager"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-device-manager"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-device-manager-test"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-device-manager-test"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # time_offset.tomorrow will be created
  + resource "time_offset" "tomorrow" {
      + base_rfc3339 = (known after apply)
      + day          = (known after apply)
      + hour         = (known after apply)
      + id           = (known after apply)
      + minute       = (known after apply)
      + month        = (known after apply)
      + offset_days  = 1
      + rfc3339      = (known after apply)
      + second       = (known after apply)
      + unix         = (known after apply)
      + year         = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca01"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca02"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwctestca01"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwctestca02"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca01"] will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "lbxwcca01"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-xwc-core-001"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "fe-lbxwcca01"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.193.160.15"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
          + zones                                              = (known after apply)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwctestca01"] will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "lbxwctestca01"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-xwc-core-001"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "fe-lbxwctestca01"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.193.160.132"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-test"
          + zones                                              = (known after apply)
        }
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca01"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "be-lbxwcca01"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwctestca01"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "be-lbxwctestca01"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca01"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.193.160.16"
      + name                    = "be-pool-ip-vmxwcca01"
      + virtual_network_id      = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca02"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.193.160.17"
      + name                    = "be-pool-ip-vmxwcca02"
      + virtual_network_id      = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwctestca01"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.193.160.133"
      + name                    = "be-pool-ip-vmxwctestca01"
      + virtual_network_id      = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwctestca02"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.193.160.134"
      + name                    = "be-pool-ip-vmxwctestca02"
      + virtual_network_id      = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca01"] will be created
  + resource "azurerm_lb_probe" "health_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "rule-3389-lbxwcca01"
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwctestca01"] will be created
  + resource "azurerm_lb_probe" "health_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "rule-3389-lbxwctestca01"
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca01"] will be created
  + resource "azurerm_lb_rule" "loadbalancing_rule" {
      + backend_address_pool_id        = (known after apply)
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "fe-lbxwcca01"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "SourceIPProtocol"
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-3389-lbxwcca01"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwctestca01"] will be created
  + resource "azurerm_lb_rule" "loadbalancing_rule" {
      + backend_address_pool_id        = (known after apply)
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "fe-lbxwctestca01"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "SourceIPProtocol"
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-3389-lbxwctestca01"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca01"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcca01"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.193.160.16"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca02"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcca02"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.193.160.17"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwctestca01"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwctestca01"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.193.160.133"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-test"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwctestca02"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwctestca02"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.193.160.134"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-test"
        }
    }

  # module.cloud-agent.azurerm_virtual_machine.VM["vmxwcca01"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwcca01"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-xwc-core-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "Gold1"
        }
      + vm_size                          = "Standard_D4_V4"
      + zones                            = [
          + "1",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag001.blob.core.windows.net/"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "data-vmxwcca01"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "os-vmxwcca01"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.cloud-agent.azurerm_virtual_machine.VM["vmxwcca02"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwcca02"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-xwc-core-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "Gold2"
        }
      + vm_size                          = "Standard_D4_V4"
      + zones                            = [
          + "2",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag001.blob.core.windows.net/"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "data-vmxwcca02"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "os-vmxwcca02"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.cloud-agent.azurerm_virtual_machine.VM["vmxwctestca01"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwctestca01"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-xwc-core-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "test"
        }
      + vm_size                          = "Standard_D4_V4"
      + zones                            = [
          + "1",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag001.blob.core.windows.net/"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "data-vmxwctestca01"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "os-vmxwctestca01"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.cloud-agent.azurerm_virtual_machine.VM["vmxwctestca02"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwctestca02"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-xwc-core-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "test"
        }
      + vm_size                          = "Standard_D4_V4"
      + zones                            = [
          + "2",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag001.blob.core.windows.net/"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "data-vmxwctestca02"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "os-vmxwctestca02"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.AVEXT["vmxwcca01"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "IaaSAntimalware"
      + publisher                  = "Microsoft.Azure.Security"
      + settings                   = jsonencode(
            {
              + AntimalwareEnabled        = true
              + Exclusions                = {
                  + Extensions = ""
                  + Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                  + Processes  = "NTUser.dat*"
                }
              + RealtimeProtectionEnabled = "true"
              + ScheduledScanSettings     = {
                  + day       = "7"
                  + isEnabled = "true"
                  + scanType  = "Quick"
                  + time      = "120"
                }
            }
        )
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "IaaSAntimalware"
      + type_handler_version       = "1.1"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.AVEXT["vmxwcca02"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "IaaSAntimalware"
      + publisher                  = "Microsoft.Azure.Security"
      + settings                   = jsonencode(
            {
              + AntimalwareEnabled        = true
              + Exclusions                = {
                  + Extensions = ""
                  + Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                  + Processes  = "NTUser.dat*"
                }
              + RealtimeProtectionEnabled = "true"
              + ScheduledScanSettings     = {
                  + day       = "7"
                  + isEnabled = "true"
                  + scanType  = "Quick"
                  + time      = "120"
                }
            }
        )
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "IaaSAntimalware"
      + type_handler_version       = "1.1"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.AVEXT["vmxwctestca01"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "IaaSAntimalware"
      + publisher                  = "Microsoft.Azure.Security"
      + settings                   = jsonencode(
            {
              + AntimalwareEnabled        = true
              + Exclusions                = {
                  + Extensions = ""
                  + Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                  + Processes  = "NTUser.dat*"
                }
              + RealtimeProtectionEnabled = "true"
              + ScheduledScanSettings     = {
                  + day       = "7"
                  + isEnabled = "true"
                  + scanType  = "Quick"
                  + time      = "120"
                }
            }
        )
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "IaaSAntimalware"
      + type_handler_version       = "1.1"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.AVEXT["vmxwctestca02"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "IaaSAntimalware"
      + publisher                  = "Microsoft.Azure.Security"
      + settings                   = jsonencode(
            {
              + AntimalwareEnabled        = true
              + Exclusions                = {
                  + Extensions = ""
                  + Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                  + Processes  = "NTUser.dat*"
                }
              + RealtimeProtectionEnabled = "true"
              + ScheduledScanSettings     = {
                  + day       = "7"
                  + isEnabled = "true"
                  + scanType  = "Quick"
                  + time      = "120"
                }
            }
        )
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "IaaSAntimalware"
      + type_handler_version       = "1.1"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.OMSAGENT["vmxwcca01"] will be created
  + resource "azurerm_virtual_machine_extension" "OMSAGENT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "MicrosoftMonitoringAgent"
      + protected_settings         = (sensitive value)
      + publisher                  = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                   = (known after apply)
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "MicrosoftMonitoringAgent"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.OMSAGENT["vmxwcca02"] will be created
  + resource "azurerm_virtual_machine_extension" "OMSAGENT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "MicrosoftMonitoringAgent"
      + protected_settings         = (sensitive value)
      + publisher                  = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                   = (known after apply)
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "MicrosoftMonitoringAgent"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.OMSAGENT["vmxwctestca01"] will be created
  + resource "azurerm_virtual_machine_extension" "OMSAGENT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "MicrosoftMonitoringAgent"
      + protected_settings         = (sensitive value)
      + publisher                  = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                   = (known after apply)
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "MicrosoftMonitoringAgent"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.OMSAGENT["vmxwctestca02"] will be created
  + resource "azurerm_virtual_machine_extension" "OMSAGENT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "MicrosoftMonitoringAgent"
      + protected_settings         = (sensitive value)
      + publisher                  = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                   = (known after apply)
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "MicrosoftMonitoringAgent"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.login_for_windows["vmxwcca01"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "AADLoginForWindows"
      + publisher                  = "Microsoft.Azure.ActiveDirectory"
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "AADLoginForWindows"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.login_for_windows["vmxwcca02"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "AADLoginForWindows"
      + publisher                  = "Microsoft.Azure.ActiveDirectory"
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "AADLoginForWindows"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.login_for_windows["vmxwctestca01"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "AADLoginForWindows"
      + publisher                  = "Microsoft.Azure.ActiveDirectory"
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "AADLoginForWindows"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.login_for_windows["vmxwctestca02"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "AADLoginForWindows"
      + publisher                  = "Microsoft.Azure.ActiveDirectory"
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "AADLoginForWindows"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_backup_protected_vm.VM_VAULT["vmxwcdm01"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.device-manager.azurerm_backup_protected_vm.VM_VAULT["vmxwctestdm01"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.device-manager.azurerm_key_vault_secret.password will be created
  + resource "azurerm_key_vault_secret" "password" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.KeyVault/vaults/kv-xwc-coremoj-001"
      + name           = "sql-server-administrator-password"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.device-manager.azurerm_key_vault_secret.username will be created
  + resource "azurerm_key_vault_secret" "username" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.KeyVault/vaults/kv-xwc-coremoj-001"
      + name           = "sql-server-administrator-username"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.device-manager.azurerm_mssql_database.databases["sqlxwcdm01"] will be created
  + resource "azurerm_mssql_database" "databases" {
      + auto_pause_delay_in_minutes = (known after apply)
      + collation                   = (known after apply)
      + create_mode                 = "Default"
      + creation_source_database_id = (known after apply)
      + elastic_pool_id             = (known after apply)
      + extended_auditing_policy    = (known after apply)
      + geo_backup_enabled          = true
      + id                          = (known after apply)
      + license_type                = (known after apply)
      + max_size_gb                 = (known after apply)
      + min_capacity                = (known after apply)
      + name                        = "sqlxwcdm01"
      + read_replica_count          = (known after apply)
      + read_scale                  = (known after apply)
      + restore_point_in_time       = (known after apply)
      + sample_name                 = (known after apply)
      + server_id                   = (known after apply)
      + sku_name                    = "ElasticPool"
      + storage_account_type        = "GRS"
      + tags                        = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + zone_redundant              = (known after apply)

      + long_term_retention_policy {
          + monthly_retention = (known after apply)
          + week_of_year      = (known after apply)
          + weekly_retention  = (known after apply)
          + yearly_retention  = (known after apply)
        }

      + short_term_retention_policy {
          + retention_days = (known after apply)
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # module.device-manager.azurerm_mssql_database.databases["sqlxwctestdm01"] will be created
  + resource "azurerm_mssql_database" "databases" {
      + auto_pause_delay_in_minutes = (known after apply)
      + collation                   = (known after apply)
      + create_mode                 = "Default"
      + creation_source_database_id = (known after apply)
      + elastic_pool_id             = (known after apply)
      + extended_auditing_policy    = (known after apply)
      + geo_backup_enabled          = true
      + id                          = (known after apply)
      + license_type                = (known after apply)
      + max_size_gb                 = (known after apply)
      + min_capacity                = (known after apply)
      + name                        = "sqlxwctestdm01"
      + read_replica_count          = (known after apply)
      + read_scale                  = (known after apply)
      + restore_point_in_time       = (known after apply)
      + sample_name                 = (known after apply)
      + server_id                   = (known after apply)
      + sku_name                    = "ElasticPool"
      + storage_account_type        = "GRS"
      + tags                        = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + zone_redundant              = (known after apply)

      + long_term_retention_policy {
          + monthly_retention = (known after apply)
          + week_of_year      = (known after apply)
          + weekly_retention  = (known after apply)
          + yearly_retention  = (known after apply)
        }

      + short_term_retention_policy {
          + retention_days = (known after apply)
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # module.device-manager.azurerm_mssql_elasticpool.elastic_pool will be created
  + resource "azurerm_mssql_elasticpool" "elastic_pool" {
      + id                  = (known after apply)
      + license_type        = "LicenseIncluded"
      + location            = "uksouth"
      + max_size_bytes      = (known after apply)
      + max_size_gb         = 50
      + name                = "xwc-dev-pool"
      + resource_group_name = "rg-xwc-core-001"
      + server_name         = "sqlxwcdmsrv001"
      + tags                = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + per_database_settings {
          + max_capacity = 20
          + min_capacity = 10
        }

      + sku {
          + capacity = 50
          + name     = "StandardPool"
          + tier     = "Standard"
        }
    }

  # module.device-manager.azurerm_mssql_server.sql_server will be created
  + resource "azurerm_mssql_server" "sql_server" {
      + administrator_login               = "sqladmin"
      + administrator_login_password      = (sensitive value)
      + connection_policy                 = "Default"
      + extended_auditing_policy          = (known after apply)
      + fully_qualified_domain_name       = (known after apply)
      + id                                = (known after apply)
      + location                          = "uksouth"
      + minimum_tls_version               = "1.2"
      + name                              = "sqlxwcdmsrv001"
      + primary_user_assigned_identity_id = (known after apply)
      + public_network_access_enabled     = false
      + resource_group_name               = "rg-xwc-core-001"
      + restorable_dropped_database_ids   = (known after apply)
      + tags                              = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + version                           = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = (known after apply)
          + login_username              = "Mojo-Azure-ManagementGroup-MoJ_Owner"
          + object_id                   = "0484bc5c-7eb4-4e99-8ff6-a67b1afb34b2"
          + tenant_id                   = (known after apply)
        }
    }

  # module.device-manager.azurerm_network_interface.NIC["vmxwcdm01"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcdm01"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.193.160.4"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.device-manager.azurerm_network_interface.NIC["vmxwctestdm01"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwctestdm01"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (kn